
# https://stackoverflow.com/questions/28618400/how-to-identify-the-subject-of-a-sentence 



sent = """
Приучиться к раннему подъему, посещать зал три раза в неделю, выучить иностранный язык. Инстаграм (_запрещенный в РФ_) каждый новый год вываливает тысячи списков обязательств, кочующих из года в год, в новый список. После очередного провала начинается вселенский вой, что привычка не прижилась, не хватило решимости, настойчивости и просто что-то поломалось. И вообще, сила есть, воля есть, а силы воли и дисциплины нет, вот такой вот человек. Но мало кто понимает что на самом такое дисциплина. От этого и все сложности со всякого рода списками новогодних обязательств. Воспитывать следует не дисциплину, а изменять жизнь.

Дисциплинированная жизнь – это жизнь монаха, а не солдата. Не следует заставлять что-то делать. Необходимость сделать возникает изнутри, если для нее требуются внешние факторы, то вероятность факапа вырастает кратно\[^1\]. Но что страшнее, необходимость делать что-то воспринимается обязанностью, а дисциплинированная жизнь это не про обязательства, а про удовольствие и радость в каждом действии, каким бы сложны оно ни было.

Радислав Гандапас[^2](https://www.radislavgandapas.com/), часто говорит, что необходимо призвать себя в армию. По началу это кажется привлекательным, да, призвать в армию. Там дисциплина, там порядок, там научат. Но служба заканчивается и все забывается, дрова в дровнице дисциплины ни кем не пополняются. Монах совсем другое дело, упорство без усилий – единственная дорога к успеху. Когда все части тела и ума работают синхронно, вместо самобичевания и исполнения, мирная и спокойная поступь по направлению к цели. В этом основное отличие дисциплинированного солдата и монаха, живущего дисциплинированной жизнью.

Имеет смысл размышлять не о дисциплине, а о дисциплинированной жизни. Это гармоничная жизнь с тонко настроенными целями и ценностями. Жизнь с соотносящимися устремлениями и действиями. На самом деле дисциплинированная жизнь – это комбинация нашего внимания, того куда направлены устремления и намерений, набора действий. Если еще проще, дисциплинированная жизнь – это действия в направлении того, что привлекает внимание. Именно поэтому дисциплинированная жизнь – это сложная система\[^3\], взаимоувязанных элементов\[^4\]. Действий в соответствии с ценностями изо дня в день, от момента к моменту. Умение преодолевать препятствия, при этом следует помнить, что все препятствия в голове\[^5\]. Для тренировки умения жить дисциплинированной жизнь, необходим набор тренируемых навыков.

#### Навыки дисциплинированной жизни

_Концентрация_. В современно мире выживает на сильнейший, а наиболее сфокусированный\[^6\]. “Я решил, значит делаю”, мантра на каждый день. Но опять это не армия, а жизнь.  
_Сила воли_. Не стоит полагаться исключительно на нее. Многие считают, что если чего-то не получается, значит нет или силы воли, или дисциплины. Но оказывается, что не хватает силы воли изменится. Перетряхнуть набор убеждений. Нет силы воли означает что не хватает решимости и самодисциплины.  
_Самоконтроль_.  
_Целеустремленность_.  
_Целостность_. Умение держать обещания, данные самому себе.  
_Естественность_.  
_Щедрость._ К себе и в отношении других.  
Видение. Куда идти и зачем.  
_Ответственность и причастность_.  
_Упорство и стойкость_.  
_Твердость характера_. Умение придерживаться плана, даже когда думаешь, что все напрасно.  
_Цельность_. Целей, устремлений и ценностей.  
_Рост_. Учиться тому как учиться.  
_Антропоцентричность_. Избавление от персонального я, в угоду коллективного мы (куда я включено).  
_Превосходство_.  
_Любовь к себе_.  
_Соотнесение себя с будущим я_. С новой идентичностью.

Однако даже если обстоятельства удачны и удалось натренировать навыки, этого недостаточно. Требуется еще один важный элемент – ритм жизни. Плавность событий, при которой события происходят надежно и относительно запланировано, своего рода система. И это дело уже наших привычек. Человек не более чем набор привычек и убеждений\[^7\]. Для воспитания нового “я” требуется ломать убеждения, пересобрать ценности. Превратиться в дизайнера жизни – непросто, но возможно.

Дисциплинированная жизнь приносит плоды, пропитанные духом успеха и личных достижений, благосостояния, счастья. А не жалости к себе, обиды и ограниченности взглядов, как случается с человеком призвавшим себя в армию.

> Самодисциплина – это форма свободы. Свобода от лени и вялости, свобода от ожиданий и требований других людей, свобода от слабости, страха и сомнений. Самодисциплина позволяет человеку почувствовать свою индивидуальность, свою внутреннюю силу, свой талант. Он становится хозяином, а не рабом своих мыслей и эмоций.
> 
> Харви Дорман[^8](https://csldallas.org/discipline-is-a-form-of-freedom/)

___

## BIO

**Keywords**:

**Related**:  
\[\[[Дисциплина это свобода](https://rustamagamaliev.ru/?p=409)\]\]

**Reference**:

\[^1\]: \[\[[система и внешние элементы](https://rustamagamaliev.ru/?p=315)\]\]  
\[^3\]: \[\[[Системы вместо целей](https://rustamagamaliev.ru/?p=312)\]\]  
\[^4\]: \[\[[Чем может являться система](https://rustamagamaliev.ru/?p=978)\]\]  
\[^5\]: \[\[[The Practicing Stoic](https://rustamagamaliev.ru/?p=36)#Externals\]\]  
\[^6\]: \[\[[Deep Work](https://rustamagamaliev.ru/?p=308)\]\]  
\[^7\]: \[\[[Мы не более чем набор убеждений о мире](https://rustamagamaliev.ru/?p=426)\]\]

"""


sent="""
## К чёрту мотивацию, вам нужна дисциплина

Время на прочтение 4 мин

Количество просмотров 110K

Если вы желаете что-то сделать, то есть два способа этого достичь.

Первый, более распространённый и в значительной мере неправильный вариант — попытаться мотивировать себя.

Второй, весьма непопулярный, но абсолютно правильный выбор — воспитание дисциплины.

Это одна из ситуаций, когда принятие другой точки зрения немедленно приводит к превосходным результатам. Немногие употребления термина «сдвиг парадигмы» являются, на самом деле, оправданными, но это — одно из них. Эту идею можно сравнить с озарением.

В чём же разница?  
  
**Мотивация, вообще говоря, исходит из ошибочного предположения, что для выполнения какой-то задачи требуется определённое психическое или эмоциональное состояние.**

Но это совершенно неправильный путь.

**Дисциплина, напротив, отделяет внешнее функционирование от настроений и чувств и _тем самым, по иронии судьбы, обходит проблему, последовательно улучшая их_.**

Последствия огромны.

**Успешное решение задач приводит к внутренним состояниям, которые хронические прокрастинаторы считают необходимым условием для начала решения задач.**

Говоря проще, **не надо ждать, когда вы достигнете олимпийской формы, чтобы приступить к тренировкам. Надо тренироваться, чтобы достичь олимпийской формы.**

Если действие обусловлено чувствами, то ожидание правильного настроения становится особенно коварной формой промедления. Я знаю это сейчас слишком хорошо и очень хотел бы, чтобы кто-нибудь указал мне на это тогда — двадцать, пятнадцать или десять лет назад — до того, как я понял разницу на своём собственном горьком опыте.

Если вы будете ждать желания действовать, то вы останетесь в дураках. Именно так и возникают ужасающие воронки прокрастинации.

![](https://habrastorage.org/r/w1560/files/86a/8bb/478/86a8bb478b324f82998a63fa0c7eb296.jpg)  
По своей сути мотивация устремлённости к чему-то является навязыванием инфантильной фантазии, что мы должны делать только то, что _нам нравится_. Проблему тогда можно сформулировать так: «Как мне _заставить себя захотеть делать_ то, что я рационально решил сделать?» Нет, это плохо.

Правильный вопрос: «Как мне сделать мои чувства несущественными и делать то, что я сознательно хочу делать, не рефлексируя из-за этого?»

Суть в том, чтобы обрезать связь между чувствами и действиями и просто делать. _После этого_ вы почувствуете себя хорошо, станете подвижным, энергичным и активным.

Мотивация — совершенно неправильный путь. Я на 100% уверен, что этот ложный посыл является главной причиной эпидемии времяпровождения на диване в одном нижнем белье в играх с Xbox и с самим собой, которая сейчас охватила развитые страны.

В опоре на мотивацию есть и психологические проблемы.

Поскольку реальная жизнь в реальном мире время от времени требует от людей делать то, от чего никто в здравом уме не может испытывать восторга, «мотивация» наталкивается на непреодолимое препятствие, пытаясь вызвать энтузиазм к вещам, объективно не заслуживающим этого. Тогда единственным решением, кроме бездействия, становится подталкивание людей к отказу от здравого смысла. Это — очень неприятная, но, к счастью, ошибочная дилемма.

Стремление вызвать энтузиазм по поводу, в основе своей, тупых и разрушающих душу действий является буквально формой преднамеренного психологического травмирования самого себя, добровольным безумием: «Я ТАК УВЛЕЧЕН ЭТИМИ ЭЛЕКТРОННЫМИ ТАБЛИЦАМИ, Я НЕ МОГУ ДОЖДАТЬСЯ, КОГДА ЖЕ СМОГУ РЕШИТЬ УРАВНЕНИЕ ДЛЯ БУДУЩЕГО ЗНАЧЕНИЯ ГОДОВОЙ ВЫПЛАТЫ, Я Т-А-А-А-К ЛЮБЛЮ МОЮ РАБОТУ!!»

Я не считаю, что лёгкая форма помешательства, вызываемая в человеке им самим, является оптимальным драйвером человеческой деятельности. [Реакция вилочковой железы](https://ru.wikipedia.org/wiki/%D0%94%D0%B8%D1%81%D1%82%D0%B8%D0%BC%D0%B8%D1%8F) через проявления депрессии неизбежна, так как человеческий мозг не будет терпеть жестокое обращение с собой неопределённо долго. Имеются стопоры и предохранительные клапаны. Есть гормональное наследие, тянущееся из прошлого.

Самое неприятное, что может произойти — достижение успеха при неправильном исходном посыле. Успех этот будет лишь на короткое время. Самым лучшим сценарием является сохранение здравомыслия, которое, к сожалению, нередко неверно толкуют как моральный провал: _«Я всё ещё не люблю свою бессмысленную работу по перекладыванию бумаги, я что-то делаю не так». «Я всё ещё предпочитаю торты, а не брокколи, и не могу сбросить вес; возможно, я просто слабохарактерный человек». «Я должен купить ещё одну книгу о мотивации»_. Бред сивой кобылы! Критической ошибкой является даже рассмотрение этой проблемы с позиции мотивации или её отсутствия. Ответом является: «Дисциплина! Не мотивация!»

Есть и другая — практическая — проблема с мотивацией. У неё крошечный срок хранения, она нуждается в постоянном обновлении.

Мотивацию можно сравнить с ручным проворачиванием пусковой рукоятки двигателя. В лучшем случае она сохраняет и преобразует энергию в определённую цель. Бывают ситуации (как правило, разовые), когда она нужна, и при которых упреждающее получение гигантского количества психической и душевной энергии — наилучший образ действия. На ум приходят олимпийские игры и побеги из тюрем. Но это ужасная основа для регулярного повседневного функционирования и получения последовательных долгосрочных результатов.

Напротив, дисциплина подобна двигателю, который, будучи запущенным, действительно стабильно _поставляет энергию_ в систему.

Продуктивность не требует каких-то особых состояний духа. С позиции последовательных долгосрочных результатов дисциплина побеждает мотивацию полностью и во всём.

В целом, мотивация пытается создать желание действовать. Дисциплина побуждает действовать, даже если желания нет.

Хорошие ощущения будут _потом_.

Дисциплина — система, тогда как мотивация аналогична целям. Здесь есть симметрия. Дисциплина является более или менее самоподдерживающейся и постоянной, тогда как мотивация — это явление вспышек.

Как развивать дисциплину? Выстраивая привычки — начинать с как можно меньшего дела, которым вы можете управлять, даже микроскопического, и набирать обороты, реинвестируя результат во всё более крупные изменения в вашей повседневности, создавать цикл положительной обратной связи.

Мотивация — ведущее в тупик отношение к производительности. Главное — дисциплина!
"""

sent = """
Инструменты определяют наши процессы.
Недавно в разговоре с опытным менеджером по платформе данных услышал мысль: «The tools we use for data infrastructure influence and sometimes define our operational model and processes, whether we want them to or not. Even if the tools do not imply it directly, they do shape it anyway». Эта мысль меня зацепила, вроде бы банальна, но навела на размышления.

С одной стороны — инструменты не главное. Главное люди, процессы и «универсальные» навыки. Я, например, это сильно почувствовал, когда мы переходили с Tableau на DataLens. Инструмент совершенно другой, с другими особенностями и требованиями. Но так как у нас уже была крутая команда, мы перестроились и смогли классно завершить проект переезда.

С другой стороны — инструменты определяют процессы и образ мышления. В Tableau есть экстракты → аналитики менее ответственно готовят данные, можно расслабиться и не строить процессы в этом месте (хотя обычно только какое-то время 😈, пока не начинают падать процессы создания экстрактов). DataLens ходит в базы только в live-режиме → надо нормально готовить таблицы, чтобы база не умерла при открытии дашборда, поэтому вокруг подготовки данных появились отдельные чек-листы, инструменты, обучения и проверки. Работаете с Tableau → понимаете, что такое визуальный примитив и как устроена визуализация данных, следите за падингами и дизайном. Используете другие BI → мыслите типами графиков и их шаблонами, большая часть дизайна заложена в саму систему.

Итого
Выбирая инструменты, будь то Business Intelligence для компании или какую программу или язык программирования учить, смотрите не только на набор фичей и технических характеристик, но и какая философия/концепт стоит за инструментом, насколько он вам близок и как это повлияет на ваши процессы и образ мышления.

П.С. Небольшая пасхалочка на картинке для любителей музыки. В свете размышлений по-другому взглянул на название своей любимой группы 😂 Про них, кстати, даже дашборд есть на Tableau Public, забавно когда встречаются два увлечения.
"""

sent = """
Уровень сложности Средний

Время на прочтение 4 мин

Количество просмотров 24K

У **Wireguard** есть немало прекрасного, включая его простоту реализации, скорость и минималистичные клиенты, которые не вызывают проблем у пользователей.

В начале августа некоторые интернет операторы и провайдеры начали блокировку протокола WireGuard в РФ по его рукопожатию.

Лично испытывал блокировку у Мегафон и Теле2, но не заметил у Ростелеком. VPN по-прежнему работал через последнего.

Очень не хотелось отказываться от **Wireguard** в пользу прокси-серверов в духе VLESS+TLS-Vision, в виду того, что все наши пользователи уже сильно привыкли именно к **Wireguard**.  
Поэтому вариант с кардинальной сменой клиентского софта не рассматривался.

Поскольку трафик **Wireguard** блокируется только на зарубежные адреса было принято решение добавить еще один хоп в систему, а начальное подключение осуществлять к серверу в РФ.

![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/73a/b44/4ab/73ab444ab737086ae79634bb9796faf4.png)

Пользователь → Wireguard РФ → обфускатор в РФ → обфускатор в EU → Internet

В качестве обфускатора выбран _shadowsocks_. Причём с AED шифрованием. Оно уже детектируется **GFW** ([https://en.wikipedia.org/wiki/Great\_Firewall](https://en.wikipedia.org/wiki/Great_Firewall)), но еще не детектируется у нас. Этот выбор позволит нам всё сильно упростить.

На сервере в EU ставим shadowsocks

```
apt update
apt install shadowsocks-libev
```

Редактируем `/etc/shadowsocks-libev/config.json`

```
{
    "server":["0.0.0.0"],
    "mode":"tcp_and_udp",
    "server_port":8443,
    "password":"YourPassword",
    "timeout":86400,
    "method":"chacha20-ietf-poly1305"
}
```

Конфиг говорит, что SOCKS5 сервер будет слушать порт 8443 по TCP/UDP с заданным метод шифрования и паролем.

Разрешаем коннект только с нашего российского сервера. Делаю через `nftables sets`

```
table inet filter {
set ALLOWED_SPROXY {
    type ipv4_addr;
    elements = { 195.0.0.356 }
}

chain input {
...
ip saddr @ALLOWED_SPROXY counter udp dport 8443 accept comment "SPROXY"
        ip saddr @ALLOWED_SPROXY counter tcp dport 8443 accept comment "SPROXY"
...
}

...
}
```

Запуск

`systemctl enable --now shadowsocks-libev`

Проверим, что порт слушается

`ss -nltu 'sport = 8443'`

Переходим к серверу в РФ.

Считаем, что **Wireguard** у нас уже поднят на сервере. На нём не останавливаемся.

Поскольку shadowsocks это прокси, а нам нужно маршрутизировать весь трафик из РФ в EU, то нам нужен сетевой интерфейс на сервере, который будет перенаправлять трафик в shadowsocks.

Из коробки shadowsocks может либо слушать порт без SOCKS и отправлять его дальше (ss-tunnel), либо слушать socks сразу на хосте (ss-local). Оба варианта не подходят, т.к. ни один из них не создаёт интерфейс.

Поэтому мы ставим **tun2socks**.

[https://github.com/xjasonlyu/tun2socks](https://github.com/xjasonlyu/tun2socks)

Он будет использовать _tun_\-интерфейс, с которого уже отправит трафик в shadowsocks в EU.

Я собрал из исходников

`go install github.com/xjasonlyu/tun2socks/v2@latest`

Но можно скачать и готовый [бинарный файл](https://github.com/xjasonlyu/tun2socks/releases).

В _tun_\-интерфейс будет маршрутизироваться весь трафик, кроме трафика на сервер в EU и трафика localhost.

**tun2socks** умеет работать с протоколом shadowsocks, т.к. использует _go-shadowsocks2-core_, что очень удобно. Нам не придется ставить shadowsocks на сервер в РФ.

[https://github.com/xjasonlyu/tun2socks/blob/main/proxy/shadowsocks.go#L9C2-L9C44](https://github.com/xjasonlyu/tun2socks/blob/main/proxy/shadowsocks.go#L9C2-L9C44)

В `/etc/sysctl.conf` должен быть включен форвардинг

`net.ipv4.ip_forward=1`

На сервере в РФ нужно поменять маршрутизацию.

-   Нужно будет добавить новый шлюз по умолчанию через _tun0_
    
-   Сделать исключение для IP сервера в EU
    
-   Старому шлюзу по умолчанию нужно будет повысить метрику
    
-   Создать дополнительную таблицу маршрутизации для IP адреса на сервере (если она уже не создана хостером), чтобы трафик на этот IP не уходил в туннель
    

То есть в итоге у нас будет два шлюза по умолчанию. Если по какой-либо причине tun отвалится, то сервер будет доступен.

Как добавить именно tun/tap (не tunnel) интерфейс в netplan, я не нашёл. Поэтому интерфейс и маршруты прописываю в хуки _systemd unit_. Подразумевается, что интерфейс сервера это _ens3._ IP адрес _tun0_ роли не играет.

```
[Unit]
Description=Tun2Socks
After=network.target

[Service]
Type=simple
User=root
EnvironmentFile=/etc/default/tun2socks
ExecStartPre=-ip tuntap add mode tun dev tun0
ExecStartPre=ip addr add 192.168.0.33/24 dev tun0
ExecStartPre=ip link set dev tun0 up
ExecStart=tun2socks -device tun://tun0 -proxy ss://chacha20-ietf-poly1305:${SSPASSWORD}@${SSIP}:${SSPORT}
ExecStartPost=bash -c 'MIP=$(ip r l |grep "default via" | cut -f3 -d" "); LIP=$(ip a l ens3 | awk \'/inet /{ print $2 }\' | cut -f1 -d"/"); ip r del default dev ens3; ip r add default via $MIP dev ens3 metric 200; ip rule add from $LIP table lip; ip r add default via $MIP dev ens3 table lip; ip r add ${SSIP}/32 via $MIP dev ens3'
ExecStartPost=ip r add default dev tun0 metric 50
ExecStopPost=-ip r flush table lip
ExecStopPost=-ip rule delete table lip
ExecStopPost=-ip link set dev tun0 down
ExecStopPost=-ip link del dev tun0
ExecStopPost=-ip r del ${SSIP}/32 dev ens3

[Install]
WantedBy=multi-user.target
```

В `/etc/default/tun2socks` находятся реквизиты подключения в серверу в EU

```
SSIP=195.0.0.357
SSPORT=8443
SSPASSWORD=YourPassword
```

В пароле нужно избегать символов _/_ и _:_, чтобы не нарушить парсинг URI.

  
Добавляем таблицу для маршрутизации в конец `/etc/iproute2/rt_tables`  

```
...
# local
#
20 lip
```

`systemctl enable --now tun2socks`

Сетевая задержка между серверами колеблется в районе 25-30ms, что не так уж и плохо.

Итоговая скорость хорошая, клиенты довольны.

Рассчитываем, что с этим можно жить еще минимум пару-тройку лет не беспокоясь об усилении лютости DPI провайдеров.

В дальнейшем между перед shadowsocks планирую установить _HaProxy_ для более гибкой балансировки на несколько узлов зарубежных VPN, а также для повышения отказоустойчивости. Но пока с текущей базой пользователей этот шаг выглядит избыточным.
"""


sent2 = """

Что выбрать: BASB или LYT⚖️

Сегодня сравним между собой две методики ведения заметок: Building a Second Brain Тиаго Форте и Linking Your Thinking Ника Майло.

Обычно, эти две системы рассматривают по отдельности. Но я в этой статье сравню их между собой и напишу, для кого, по моему мнению, лучше подойдёт тот или иной метод.

Если вы вдруг не в курсе, что это за названия, у меня в блоге есть обзоры обеих систем. Рекомендую ознакомиться по ссылкам выше.


В чём между ними разница — в двух словах

Если попытаться выразить разницу в одном предложении, я бы написал так. Building a Second Brain — это система для хранения чужих мыслей, а Linking Your Thinking — своих.

Или так. BASB — это про хранение длинных текстов и конспектов, а LYT — для развития собственных идей.

Дальше разверну эту мысль подробнее.


BASB — свинья-копилка для полезных источников

Собственно говоря, BASB это вообще не про заметки.

Тиаго Форте всегда говорил о своей системе, как о способе обработки и организации большого количества информации, с которой мы сталкиваемся каждый день в виде книг, статей, видео, подкастов и так далее. Он предлагает использовать заметочники типа Evernote, как универсальный инструмент для хранения текстов, ссылок, фото, видео и аудио контента.

Его рабочий процесс CODE, который лежит в основе системы, идеально подходит для обработки статей, но начинает сбоить как только пытаешься применить его к собственным многочисленным мыслям и идеям.

Напомню, что CODE расшифровывается как Capture, Organize, Distill и Express. Сбор, Организация, Уточнение и Использование.

Тебе попадается статья или видео на какую-то интересующую тебя тему и ты сохраняешь её в закладках или с помощью веб-клиппера своего приложения для заметок. Потом ты разбираешь инбокс и сортируешь статьи, источники по разным папкам, в зависимости от системы PARA.

На третьем этапе начинается обработка этих источников по методу прогрессивного конспектирования, Progressive Summarization. Это когда из статьи выделяется самый сок, самое полезное.

Ну и дальше идёт использование этих материалов для своих проектов.

В примере со статьями этот фреймворк работает идеально. Но не с заметками. В системе Форте, как мне кажется, вообще почти ни слова нет о том, как работать со своими мыслями и идеями. Это больше и не про заметки, а про организацию цифрового контента.


LYT — почти что цеттелькастен

В основе системы Lynking Your Thinking Ника Майло — тоже структура из папок, причём намного мудрёнее, чем у Тиаго. Но всё же LYT гораздо ближе по духу к цеттелькастен, нежели BASB да и вообще все остальные встречавшиеся мне системы.

Смысл в том, что Ник предлагает оперировать собственными мыслями. Даже чужие идеи он советует описывать в контексте своих собственных интересов и целей. Для этого он придумал свой NoMa-метод. Это как раз то, что Зонке Аренс называл «думать о том, как одна идея может быть полезна в контексте другой».

Не смотря на то, что у Ника тоже есть определённая и довольно сложная система папок, он всё же делает упор не на структуру, а на содержание заметок, их связи друг с другом и развитие идей.

Поэтому в качестве среды для мышления, а не хранения информации, LYT подходит очень хорошо.


Что выбрать?

Итак, повторим ещё раз. Если вам нужно организовывать цифровой контент, прочитанные статьи, книги, видео, подкасты, материалы для актуальных и будущих проектов, то ваш выбор — Building a Second Brain и PARA Тиаго Форте. А вот для организации собственных мыслей, развития идей, лучше подойдёт Linking Your Thinking Ника Майло, как система больше похожая на цеттелькастен.

Обе эти системы можно использовать раздельно, в зависимости от целей и задач. Но можно и вместе. В системе папок Майло есть папка Sources, «Ресурсы». Это как раз сборник источников. Так что, на мой взгляд, в системе LYT вполне можно обустроить свою папку «Ресурсы» в соответствии с системой Тиаго.

***
"""

sent2 = """
_«В жизни есть только две проблемы: вы знаете, чего хотите, но не знаете, как этого достичь, и/или вы не знаете, чего хотите»._

**Дэвид Аллен**

Что можно успеть за стандартную неделю, в которой будут переезды, привычная занятость и уже привычные, малоприятные неожиданности?

До следующего понедельника хочу совершить рывок в продвижении к цели, которую перетаскиваю из одной [Стодневки](https://stodnevka.ru/) в другую — завершить и выложить книгу «Включи внимание. Как наполнить день решениями, а жизнь радостью».

Как в цитате автора методики GTD, моя проблема в том, что цель «написать книгу» выполнена, но понимания, зачем мне это нужно, смутное. Из-за этого я оттягиваю редактирование готового текста. Открываю файл и не знаю, с чего начать. Просматриваю несколько глав и закрываю приложение. Формально, я прикоснулся к цели. По факту — укрепил сомнения в нужности этого начинания.

Нашёл мотивацию довести эту задачу до точки — показать на собственном примере, как работают инструменты [Стодневки](https://stodnevka.ru/). Начинаю с обработки целей.

### Зачем обрабатывать цели

Многие цели мы не достигаем по глупейшей причине – забываем о них. Предлагаю несложную практику, всего на одну неделю. Этого хватит, чтобы убедиться, сколько возможностей, дополнительных действий и удовлетворения появится благодаря 10-15 минутам с утра, потраченных на обработку целей.

Отмечу: не переписывать, а именно обрабатывать. Есть видео, где Брайан Трейси объясняет свою технику «10 целей». По сути, это регулярное переписывание своих целей. Верю, что даже если просто повторять цели, уже будет польза, но это минимальный уровень.

Обработка подразумевает ответы на вопросы и принятие решений о ближайших действиях. Вы напоминаете себе, что хотите изменить, и определяете, что для этого сделаете сегодня. Важна последовательность. Выдержите 5-7 дней, чтобы количество перешло в качество изменений.

### Как обрабатывать цели

Делать это можно в любое удобное для вас время. Утро предпочтительнее, чтобы сразу пересмотреть план дня, выделив задачи, связанные с целью.

★ Запишите формулировки актуальных целей.

Количество целей определяйте по способности уделять им внимание. Это не список всего, что хотите достичь, а «рабочие» цели, к достижению которых прилагаются регулярные усилия. Рекомендую начать с обработки одной, приоритетной цели.

Полезно делать записи в отдельном бумажном блокноте и файле. Со временем интересно анализировать, как меняются формулировки целей.

![](https://petrosian.ru/wp-content/uploads/2023/08/%D0%9E%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B0-%D1%86%D0%B5%D0%BB%D0%B5%D0%B9-12.png)

★ Выбирайте вопрос и обрабатывайте им цель.

Вопросы можно выбирать по очереди, случайно, можно комбинировать их между собой. Главное — наполнить мысли о желаемом вниманием и решить, что вы можете сделать сейчас для приближения к цели.

★ Отвечайте на вопросы письменно. Работайте по таймеру, 5-10 минут достаточно.

★ После завершения запишите решения, что вы сделаете для целей, каким будет ваше ближайшее действие по каждой.

**Связь обработки целей с другими инструментами Стодневки**

Результаты обработки связаны с другими инструментами: планом дня, списками задач, дневником и фрирайтингом. Какой смысл уделять внимание формулировкам желаемого, если цели не находят отражение в списке задач на день? Идеи и решения, которые будут приходить во время работы над вопросами, распределяйте по спискам проектов.

![](https://petrosian.ru/wp-content/uploads/2023/08/%D0%9E%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B0-%D1%86%D0%B5%D0%BB%D0%B5%D0%B9-2.jpg)

Письменные размышления лучше производить по [правилам фрирайтинга](https://interesno.co/myself/7da43009916e), а анализировать опыт и совершенствоваться во владении инструментами эффективно, делая записи в дневнике.

### Как вести хронику недели обработки целей

Пользу от 10-15 минут, которые ежедневно будете тратить на обработку целей, можно измерить по количеству задач, решение которых окажется полезным для продвижения к целям, по уточнению формулировок, проявленным возможностям и устранённым препятствиям.

![](https://petrosian.ru/wp-content/uploads/2023/08/%D0%A1%D0%B5%D1%82%D0%BA%D0%B0-%D0%BF%D1%80%D0%B8%D1%86%D0%B5%D0%BB%D0%B0-%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B0-%D1%86%D0%B5%D0%BB%D0%B5%D0%B9.jpg)

Ведите хронику, отмечайте. После того как запишите решения и определите ближайшие действия, выделите время и проанализируйте результаты.

★ В какое время и как обрабатывали цели, какие вопросы использовали?

★ Довольны ли итогами, почувствовали пользу или нет, какие трудности возникли?

★ Какой вопрос вы хотели бы задать? Буду оказаться вам полезным, спрашивайте через [Телеграм-бот](https://t.me/stodnevka2_bot).

**(Просмотрено: 177, сегодня: 1)**
"""
import trafilatura
import csv
import spacy
from   spacy import displacy

url="https://microsoft.github.io/lida/"
url = "https://habr.com/ru/articles/696274/"
# url ="https://rxresu.me/"
# url = "https://stackoverflow.com/a/69178995"

downloaded = trafilatura.fetch_url(url)


f = open("ini.html", "w")
f.write(downloaded)
f.close()




# 
# https://github.com/adbar/trafilatura/issues/351
sent=trafilatura.extract(downloaded.replace("</code>", "</code>\n```").replace("<code", "```\n<code")
	#, output_format='xml'
# ,include_images=True
 ,include_formatting=True
, include_links=True
# ,favor_precision=True
,include_comments=True
)

f = open("rep.html", "w")
f.write(downloaded)
f.close()
# .replace("</code>", "'''").replace("<code>", "'''")

# sent=trafilatura.extract(sent)

# sent=trafilatura.html2txt(downloaded)





f = open("1.md", "w")
f.write(sent)
f.close()




nlp = spacy.load('ru_core_news_md')
nlp=spacy.load('xx_sent_ud_sm')
# nlp=spacy.load('ru_core_news_lg') 
# nlp=spacy.load('en_core_web_lg') 
nlp=spacy.load('en_core_web_trf') 

doc=nlp(sent)

sub_toks = [tok for tok in doc if (tok.dep_ == "nsubj") ]
sub_toks_lemma = [tok.lemma_.lower() for tok in doc if (tok.dep_ == "nsubj") ]

pos_lemma = [tok.lemma_.lower() for tok in doc if (tok.pos_ == "PROPN") ]
print("spacy") 
print(sub_toks) 
print("spacy lemma") 
print(sub_toks_lemma) 

print("pos_lemma") 
print(pos_lemma)
print("--"*60)

with open('spacy.csv', 'w', newline='',encoding='utf-8') as csvfile:
	spamwriter = csv.writer(csvfile, delimiter=';', quoting=csv.QUOTE_MINIMAL)
	spamwriter.writerow(["token.text", "token.lemma_"," token.pos_"," token.tag_"," token.dep_","token.shape_"," token.is_alpha"," token.is_stop"])
	print("{0:20}{1:20}{2:20}{3:20}{4:20}{5:20}{6:20}{7:20}".format("token.text", "token.lemma_"," token.pos_"," token.tag_"," token.dep_","token.shape_"," token.is_alpha"," token.is_stop"))
	for token in doc:
		if (token.pos_ != "SPACE"):
			print("{0:20}{1:20}{2:20}{3:20}{4:20}{5:20}{6:20}{7:20}".format(token.text, token.lemma_, token.pos_, token.tag_, token.dep_,token.shape_, token.is_alpha, token.is_stop))
			spamwriter.writerow([token.text, token.lemma_, token.pos_, token.tag_, token.dep_,token.shape_, token.is_alpha, token.is_stop])

print("--"*60)

for ent in doc.ents:
    print("{0:20}{1:20}{2:20}{3:20}".format(ent.text, ent.start_char, ent.end_char, ent.label_))



svg = displacy.render(doc, style="ent", page=True)
open("displacy.html", "w", encoding="utf-8").write(svg)

from rake_nltk import Rake
import nltk
# nltk.download()
rake = Rake()

kw = rake.extract_keywords_from_text(sent)

ranked_phrases = rake.get_ranked_phrases()

print("rake_nltk") 
print(ranked_phrases)


# https://stackoverflow.com/questions/64111377/remove-markdown-code-block-from-python-string
