
# https://stackoverflow.com/questions/28618400/how-to-identify-the-subject-of-a-sentence 
import spacy


sent = """
Приучиться к раннему подъему, посещать зал три раза в неделю, выучить иностранный язык. Инстаграм (_запрещенный в РФ_) каждый новый год вываливает тысячи списков обязательств, кочующих из года в год, в новый список. После очередного провала начинается вселенский вой, что привычка не прижилась, не хватило решимости, настойчивости и просто что-то поломалось. И вообще, сила есть, воля есть, а силы воли и дисциплины нет, вот такой вот человек. Но мало кто понимает что на самом такое дисциплина. От этого и все сложности со всякого рода списками новогодних обязательств. Воспитывать следует не дисциплину, а изменять жизнь.

Дисциплинированная жизнь – это жизнь монаха, а не солдата. Не следует заставлять что-то делать. Необходимость сделать возникает изнутри, если для нее требуются внешние факторы, то вероятность факапа вырастает кратно\[^1\]. Но что страшнее, необходимость делать что-то воспринимается обязанностью, а дисциплинированная жизнь это не про обязательства, а про удовольствие и радость в каждом действии, каким бы сложны оно ни было.

Радислав Гандапас[^2](https://www.radislavgandapas.com/), часто говорит, что необходимо призвать себя в армию. По началу это кажется привлекательным, да, призвать в армию. Там дисциплина, там порядок, там научат. Но служба заканчивается и все забывается, дрова в дровнице дисциплины ни кем не пополняются. Монах совсем другое дело, упорство без усилий – единственная дорога к успеху. Когда все части тела и ума работают синхронно, вместо самобичевания и исполнения, мирная и спокойная поступь по направлению к цели. В этом основное отличие дисциплинированного солдата и монаха, живущего дисциплинированной жизнью.

Имеет смысл размышлять не о дисциплине, а о дисциплинированной жизни. Это гармоничная жизнь с тонко настроенными целями и ценностями. Жизнь с соотносящимися устремлениями и действиями. На самом деле дисциплинированная жизнь – это комбинация нашего внимания, того куда направлены устремления и намерений, набора действий. Если еще проще, дисциплинированная жизнь – это действия в направлении того, что привлекает внимание. Именно поэтому дисциплинированная жизнь – это сложная система\[^3\], взаимоувязанных элементов\[^4\]. Действий в соответствии с ценностями изо дня в день, от момента к моменту. Умение преодолевать препятствия, при этом следует помнить, что все препятствия в голове\[^5\]. Для тренировки умения жить дисциплинированной жизнь, необходим набор тренируемых навыков.

#### Навыки дисциплинированной жизни

_Концентрация_. В современно мире выживает на сильнейший, а наиболее сфокусированный\[^6\]. “Я решил, значит делаю”, мантра на каждый день. Но опять это не армия, а жизнь.  
_Сила воли_. Не стоит полагаться исключительно на нее. Многие считают, что если чего-то не получается, значит нет или силы воли, или дисциплины. Но оказывается, что не хватает силы воли изменится. Перетряхнуть набор убеждений. Нет силы воли означает что не хватает решимости и самодисциплины.  
_Самоконтроль_.  
_Целеустремленность_.  
_Целостность_. Умение держать обещания, данные самому себе.  
_Естественность_.  
_Щедрость._ К себе и в отношении других.  
Видение. Куда идти и зачем.  
_Ответственность и причастность_.  
_Упорство и стойкость_.  
_Твердость характера_. Умение придерживаться плана, даже когда думаешь, что все напрасно.  
_Цельность_. Целей, устремлений и ценностей.  
_Рост_. Учиться тому как учиться.  
_Антропоцентричность_. Избавление от персонального я, в угоду коллективного мы (куда я включено).  
_Превосходство_.  
_Любовь к себе_.  
_Соотнесение себя с будущим я_. С новой идентичностью.

Однако даже если обстоятельства удачны и удалось натренировать навыки, этого недостаточно. Требуется еще один важный элемент – ритм жизни. Плавность событий, при которой события происходят надежно и относительно запланировано, своего рода система. И это дело уже наших привычек. Человек не более чем набор привычек и убеждений\[^7\]. Для воспитания нового “я” требуется ломать убеждения, пересобрать ценности. Превратиться в дизайнера жизни – непросто, но возможно.

Дисциплинированная жизнь приносит плоды, пропитанные духом успеха и личных достижений, благосостояния, счастья. А не жалости к себе, обиды и ограниченности взглядов, как случается с человеком призвавшим себя в армию.

> Самодисциплина – это форма свободы. Свобода от лени и вялости, свобода от ожиданий и требований других людей, свобода от слабости, страха и сомнений. Самодисциплина позволяет человеку почувствовать свою индивидуальность, свою внутреннюю силу, свой талант. Он становится хозяином, а не рабом своих мыслей и эмоций.
> 
> Харви Дорман[^8](https://csldallas.org/discipline-is-a-form-of-freedom/)

___

## BIO

**Keywords**:

**Related**:  
\[\[[Дисциплина это свобода](https://rustamagamaliev.ru/?p=409)\]\]

**Reference**:

\[^1\]: \[\[[система и внешние элементы](https://rustamagamaliev.ru/?p=315)\]\]  
\[^3\]: \[\[[Системы вместо целей](https://rustamagamaliev.ru/?p=312)\]\]  
\[^4\]: \[\[[Чем может являться система](https://rustamagamaliev.ru/?p=978)\]\]  
\[^5\]: \[\[[The Practicing Stoic](https://rustamagamaliev.ru/?p=36)#Externals\]\]  
\[^6\]: \[\[[Deep Work](https://rustamagamaliev.ru/?p=308)\]\]  
\[^7\]: \[\[[Мы не более чем набор убеждений о мире](https://rustamagamaliev.ru/?p=426)\]\]

"""


sent2="""
## К чёрту мотивацию, вам нужна дисциплина

Время на прочтение 4 мин

Количество просмотров 110K

Если вы желаете что-то сделать, то есть два способа этого достичь.

Первый, более распространённый и в значительной мере неправильный вариант — попытаться мотивировать себя.

Второй, весьма непопулярный, но абсолютно правильный выбор — воспитание дисциплины.

Это одна из ситуаций, когда принятие другой точки зрения немедленно приводит к превосходным результатам. Немногие употребления термина «сдвиг парадигмы» являются, на самом деле, оправданными, но это — одно из них. Эту идею можно сравнить с озарением.

В чём же разница?  
  
**Мотивация, вообще говоря, исходит из ошибочного предположения, что для выполнения какой-то задачи требуется определённое психическое или эмоциональное состояние.**

Но это совершенно неправильный путь.

**Дисциплина, напротив, отделяет внешнее функционирование от настроений и чувств и _тем самым, по иронии судьбы, обходит проблему, последовательно улучшая их_.**

Последствия огромны.

**Успешное решение задач приводит к внутренним состояниям, которые хронические прокрастинаторы считают необходимым условием для начала решения задач.**

Говоря проще, **не надо ждать, когда вы достигнете олимпийской формы, чтобы приступить к тренировкам. Надо тренироваться, чтобы достичь олимпийской формы.**

Если действие обусловлено чувствами, то ожидание правильного настроения становится особенно коварной формой промедления. Я знаю это сейчас слишком хорошо и очень хотел бы, чтобы кто-нибудь указал мне на это тогда — двадцать, пятнадцать или десять лет назад — до того, как я понял разницу на своём собственном горьком опыте.

Если вы будете ждать желания действовать, то вы останетесь в дураках. Именно так и возникают ужасающие воронки прокрастинации.

![](https://habrastorage.org/r/w1560/files/86a/8bb/478/86a8bb478b324f82998a63fa0c7eb296.jpg)  
По своей сути мотивация устремлённости к чему-то является навязыванием инфантильной фантазии, что мы должны делать только то, что _нам нравится_. Проблему тогда можно сформулировать так: «Как мне _заставить себя захотеть делать_ то, что я рационально решил сделать?» Нет, это плохо.

Правильный вопрос: «Как мне сделать мои чувства несущественными и делать то, что я сознательно хочу делать, не рефлексируя из-за этого?»

Суть в том, чтобы обрезать связь между чувствами и действиями и просто делать. _После этого_ вы почувствуете себя хорошо, станете подвижным, энергичным и активным.

Мотивация — совершенно неправильный путь. Я на 100% уверен, что этот ложный посыл является главной причиной эпидемии времяпровождения на диване в одном нижнем белье в играх с Xbox и с самим собой, которая сейчас охватила развитые страны.

В опоре на мотивацию есть и психологические проблемы.

Поскольку реальная жизнь в реальном мире время от времени требует от людей делать то, от чего никто в здравом уме не может испытывать восторга, «мотивация» наталкивается на непреодолимое препятствие, пытаясь вызвать энтузиазм к вещам, объективно не заслуживающим этого. Тогда единственным решением, кроме бездействия, становится подталкивание людей к отказу от здравого смысла. Это — очень неприятная, но, к счастью, ошибочная дилемма.

Стремление вызвать энтузиазм по поводу, в основе своей, тупых и разрушающих душу действий является буквально формой преднамеренного психологического травмирования самого себя, добровольным безумием: «Я ТАК УВЛЕЧЕН ЭТИМИ ЭЛЕКТРОННЫМИ ТАБЛИЦАМИ, Я НЕ МОГУ ДОЖДАТЬСЯ, КОГДА ЖЕ СМОГУ РЕШИТЬ УРАВНЕНИЕ ДЛЯ БУДУЩЕГО ЗНАЧЕНИЯ ГОДОВОЙ ВЫПЛАТЫ, Я Т-А-А-А-К ЛЮБЛЮ МОЮ РАБОТУ!!»

Я не считаю, что лёгкая форма помешательства, вызываемая в человеке им самим, является оптимальным драйвером человеческой деятельности. [Реакция вилочковой железы](https://ru.wikipedia.org/wiki/%D0%94%D0%B8%D1%81%D1%82%D0%B8%D0%BC%D0%B8%D1%8F) через проявления депрессии неизбежна, так как человеческий мозг не будет терпеть жестокое обращение с собой неопределённо долго. Имеются стопоры и предохранительные клапаны. Есть гормональное наследие, тянущееся из прошлого.

Самое неприятное, что может произойти — достижение успеха при неправильном исходном посыле. Успех этот будет лишь на короткое время. Самым лучшим сценарием является сохранение здравомыслия, которое, к сожалению, нередко неверно толкуют как моральный провал: _«Я всё ещё не люблю свою бессмысленную работу по перекладыванию бумаги, я что-то делаю не так». «Я всё ещё предпочитаю торты, а не брокколи, и не могу сбросить вес; возможно, я просто слабохарактерный человек». «Я должен купить ещё одну книгу о мотивации»_. Бред сивой кобылы! Критической ошибкой является даже рассмотрение этой проблемы с позиции мотивации или её отсутствия. Ответом является: «Дисциплина! Не мотивация!»

Есть и другая — практическая — проблема с мотивацией. У неё крошечный срок хранения, она нуждается в постоянном обновлении.

Мотивацию можно сравнить с ручным проворачиванием пусковой рукоятки двигателя. В лучшем случае она сохраняет и преобразует энергию в определённую цель. Бывают ситуации (как правило, разовые), когда она нужна, и при которых упреждающее получение гигантского количества психической и душевной энергии — наилучший образ действия. На ум приходят олимпийские игры и побеги из тюрем. Но это ужасная основа для регулярного повседневного функционирования и получения последовательных долгосрочных результатов.

Напротив, дисциплина подобна двигателю, который, будучи запущенным, действительно стабильно _поставляет энергию_ в систему.

Продуктивность не требует каких-то особых состояний духа. С позиции последовательных долгосрочных результатов дисциплина побеждает мотивацию полностью и во всём.

В целом, мотивация пытается создать желание действовать. Дисциплина побуждает действовать, даже если желания нет.

Хорошие ощущения будут _потом_.

Дисциплина — система, тогда как мотивация аналогична целям. Здесь есть симметрия. Дисциплина является более или менее самоподдерживающейся и постоянной, тогда как мотивация — это явление вспышек.

Как развивать дисциплину? Выстраивая привычки — начинать с как можно меньшего дела, которым вы можете управлять, даже микроскопического, и набирать обороты, реинвестируя результат во всё более крупные изменения в вашей повседневности, создавать цикл положительной обратной связи.

Мотивация — ведущее в тупик отношение к производительности. Главное — дисциплина!
"""

nlp = spacy.load('ru_core_news_md')

doc=nlp(sent)

sub_toks = [tok for tok in doc if (tok.dep_ == "nsubj") ]
print("spacy") 
print(sub_toks) 


from rake_nltk import Rake

rake = Rake()

kw = rake.extract_keywords_from_text(sent)

ranked_phrases = rake.get_ranked_phrases()

print("rake_nltk") 
print(ranked_phrases)
